#  1
# Створити рядок з Вашим прізвищем, ім’ям та по-батькові (наприклад,
# “Руденко Іван Семенович”). З використанням методів та функцій рядків
# Python вивести
# довжину цього рядка і кількість пробілів у ньому;
# ім’я та прізвище (для прикладу, Іван Руденко);
# Ваші ініціали (для цього прикладу: РІС);
# Зробити усі літери прописними;
# Вставити в цей рядок в кінець кому та дату Вашого народження в
# форматі YYYY.MM.DD

my_name = "Фастовець Нікіта Миколайович"

print(f"Довжина рядка: {len(my_name)}\n")
print(f"Кількість пробілів у рядку: {my_name.count(' ')}\n")
print(f"Ім'я та прізвище: {my_name.split()[1]} {my_name.split()[0]}\n")
print(f"Ініціали: {my_name[0]}.{my_name.split()[1][0]}.{my_name.split()[2][0]}.")
print(f"Прописні літери: {my_name.upper()}\n")
print(f"Дата народження: {my_name + ', 2006.12.01'}")

# 2
# Для рядка визначити
# ” https://istories.media/workshops/2020/11/11/vvedenie-v-python-chast2-stroki/ ”
# чи складається рядок із цифр;
# чи складається рядок із цифр або букв;
# чи складається рядок із символів у нижньому регістрі;
# чи складається рядок із символів, що не відображаються;
# чи містить цей рядок підрядок “11”.

ch = "https://istories.media/workshops/2020/11/11/vvedenie-v-python-chast2-stroki/"

print("Рядок складається із чисел") if ch.isdigit() else print("Рядок не складається із чисел")
print("Рядок складається із чисел або букв") if ch.isalnum() else print("Рядок не складається із чисел або букв")
print("Рядок складається із символів у нижньому регістрі") if ch.islower() else print("Рядок не складається із символів у нижньому регістрі")
print("Рядок складається із символів, що не відображаються") if all(not c.isprintable() for c in ch) else print("Рядок не складається із символів, що не відображаються")
print("Рядок містить підрядок '11'") if ch.find("11") != -1 else print("Рядок не містить підрядок '11'")

# 3
# Для рядка
# “ Don't worry, it's a piece of cake, there will be no problem! Choose a
# job you love, and you will never have to work a day in your life!!! ’
# із використанням індексів та слайсів
# вивести перші 5 символів;
# останні 10 символів;
# всі символи, починаючи з 10-го і до кінця;
# всі символи, починаючи з 4-го і до передостаннього із кроком 3;
# всі символи у зворотному порядку (починаючи із кінця)

s = "Don't worry, it's a piece of cake, there will be no problem! Choose a job you love, and you will never have to work a day in your life!!!"

print(f"Перші 5 символів: {s[:5]}\n")
print(f"Останні 10 символів: {s[-10:]}\n")
print(f"Всі символи, починаючи з 10-го і до кінця: {s[9:]}\n")
print(f"Всі символи, починаючи з 4-го і до передостаннього із кроком 3: {s[3:-1:3]}\n")
print(f"Всі символи у зворотному порядку: {s[::-1]}\n")

# 3
# Для рядка із п. 3:
# видалити пробіли на початку та наприкінці рядка;
# зробити початок усіх слів із заголовної (великої літери);
# підрахувати, скільки разів в рядок входить артикль “a”;
# знайти індекс першого входження артиклю “a”;
# замінити артикль “a” на займенник “any” тільки у другому реченні;
# Розділити цей рядок на два за розподільником знак оклику.

sentences = s.split("!")
sentences[1] = " ".join(["any" if w.strip(".,!") == "a" else w for w in sentences[1].split()])
result = "!".join(sentences)

print(f"Видалити пробіли на початку та наприкінці рядка: {s.strip()}\n")
print(f"Зробити початок усіх слів із заголовної (великої літери): {s.title()}\n")
print(f"Підрахувати, скільки разів в рядок входить артикль 'a': {sum(1 for word in s.split() if word.strip('.,!') == 'a')}\n")
print(f"Знайти індекс першого входження артиклю 'a': {s.find(' a ')}\n")
print(f"Замінити артикль 'a' на займенник 'any' тільки у другому реченні: {result}\n")
print(f"Розділити цей рядок на два за розподільником знак оклику: {s.split('!')}\n") 